src/cfe/Catalogs/HTTPСервисы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>HTTPСервисы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Включен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Схема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СхемыHTTPСервисов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/CommonModules/HTTPСервисЗапросыСлужебный/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

#Область Обработчики

// Возвращает таблицу обработчиков запросов.
//
// Возвращаемое значение:
//  ТаблицыЗначений
//
Функция ОбработчикиЗапросов() Экспорт
	
	Обработчики = НовыйОбработчики();
	HTTPСервисЗапросыПереопределяемый.ПриДобавленииОбработчиковЗапросов(Обработчики);
	Возврат Обработчики;
	
КонецФункции

// Возвращает таблицу обработчиков проверки запросов.
//
// Возвращаемое значение:
//  ТаблицыЗначений
//
Функция ОбработчикиПроверкиЗапросов() Экспорт
	
	Обработчики = НовыйОбработчики();
	HTTPСервисЗапросыПереопределяемый.ПриДобавленииОбработчиковПроверкиЗапросов(Обработчики);
	Возврат Обработчики;
	
КонецФункции

// Возвращает таблицу обработчиков проверки ответов.
//
// Возвращаемое значение:
//  ТаблицыЗначений
//
Функция ОбработчикиПроверкиОтветов() Экспорт
	
	Обработчики = НовыйОбработчики();
	HTTPСервисЗапросыПереопределяемый.ПриДобавленииОбработчиковПроверкиОтветов(Обработчики);
	Возврат Обработчики;
	
КонецФункции

// Возвращает таблицу обработчиков проверки прав доступа.
//
// Возвращаемое значение:
//  ТаблицыЗначений
//
Функция ОбработчикиПроверкиПравДоступа() Экспорт
	
	Обработчики = НовыйОбработчики();
	HTTPСервисЗапросыПереопределяемый.ПриДобавленииОбработчиковПроверкиПравДоступа(Обработчики);
	Возврат Обработчики;
	
КонецФункции

// Возвращает таблицу обработчиков регистрации запроса.
//
// Возвращаемое значение:
//  ТаблицаЗначений
//
Функция ОбработчикиРегистрацииЗапроса() Экспорт
	
	Обработчики = НовыйОбработчики();
	HTTPСервисЗапросыПереопределяемый.ПриДобавленииОбработчиковРегистрацииЗапроса(Обработчики);
	Возврат Обработчики;
	
КонецФункции

// Возвращает таблицу обработчиков регистрации ответа.
//
// Возвращаемое значение:
//  ТаблицаЗначений
//
Функция ОбработчикиРегистрацииОтвета() Экспорт
	
	Обработчики = НовыйОбработчики();
	HTTPСервисЗапросыПереопределяемый.ПриДобавленииОбработчиковРегистрацииОтвета(Обработчики);
	Возврат Обработчики;
	
КонецФункции

#КонецОбласти

// Выполняет поэтапную обработку запроса.
//
// Параметры:
//  HTTPСервисЗапрос - HTTPСервисЗапрос - Входящий запрос
//  HTTPСервис - СправочникСсылка.HTTPСервисы - HTTP-сервис
//
// Возвращаемое значение:
//  HTTPСервисОтвет
//
Функция ВыполнитьОбработку(HTTPСервисЗапрос, HTTPСервис) Экспорт
	
	Контекст = НовыйКонтекст();
	Контекст.HTTPСервис = HTTPСервис;
	Контекст.HTTPСервисЗапрос = HTTPСервисЗапрос;
	HTTPСервисОтвет = ОбработчикHTTPСервисЗапроса.ВыполнитьОбработку(Контекст);
	Контекст = Неопределено;
	Возврат HTTPСервисОтвет;
	
КонецФункции

// Проверяет запрос на соответствие схеме.
//
// Параметры:
//  Схема - Структура
//  Запрос - Соответствие
//  Ошибки - Массив из Строка
//
Процедура ПроверитьЗапрос(Схема, Запрос, Ошибки) Экспорт
	
	ПроверитьПараметрыURL(Схема.ПараметрыURL, Запрос.ПараметрыURL, Ошибки);
	ПроверитьПараметрыЗапроса(Схема.ПараметрыЗапроса, Запрос.ПараметрыЗапроса, Ошибки);
	ПроверитьЗаголовкиЗапроса(Схема.ПараметрыЗаголовков, Запрос.Заголовки, Ошибки);
	Тело = ТелоПоТипуКонтента(Запрос);
	ПроверитьТелоЗапроса(Схема.ТелоЗапроса, Тело, Запрос.ТипКонтента, Ошибки);
	
КонецПроцедуры

// Проверяет ответ на соответствие схеме.
//
// Параметры:
//  Схема - Структура
//  Ответ - Соответствие
//  Ошибки - Массив из Строка
//
Процедура ПроверитьОтвет(Схема, Ответ, Ошибки) Экспорт
	
	ПроверитьЗаголовкиОтвета(Схема.Ответы, Ответ.Заголовки, Ответ.КодСостояния, Ответ.ТипКонтента, Ошибки);
	Тело = ТелоПоТипуКонтента(Ответ);
	ПроверитьТелоОтвета(Схема.Ответы, Тело, Ответ.КодСостояния, Ответ.ТипКонтента, Ошибки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроверкаЗапроса

// Проверяет заголовки запроса на соответствие схеме.
//
// Параметры:
//  Схемы - Массив из Структура
//  Заголовки - Соответствие
//  Ошибки - Массив из Строка
//
Процедура ПроверитьЗаголовкиЗапроса(Схемы, Заголовки, Ошибки)
	
	Контекст = НСтр("ru = 'Проверка заголовков запроса'");
	
	Для Каждого Схема Из Схемы Цикл
		НовыйКонтекст = СтрШаблон("%1: %2", Контекст, Схема.Имя);
		Значение = ЗначениеСвойства(Заголовки, Схема.Имя);
		
		Если Значение = Неопределено Тогда
			Если Схема.Обязательный Тогда
				ДобавитьОшибку(Ошибки, НовыйКонтекст, НСтр("ru = 'Отсутствует обязательный заголовок'"));
			КонецЕсли;
		Иначе
			ПроверитьДанныеРекурсивно(Схема, Значение, НовыйКонтекст, Ошибки);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Проверяет параметры URL на соответствие схеме.
//
// Параметры:
//  Схемы - Массив из Структура
//  Параметры - Соответствие
//  Ошибки - Массив из Строка
//
Процедура ПроверитьПараметрыURL(Схемы, Параметры, Ошибки)
	
	Контекст = НСтр("ru = 'Проверка параметров URL'");
	
	Если Схемы.Количество() <> Параметры.Количество() Тогда
		ДобавитьОшибку(Ошибки, Контекст, НСтр("ru = 'Неверное количество параметров URL'"));
		Возврат;
	КонецЕсли;
	
	Для Каждого Схема Из Схемы Цикл
		НовыйКонтекст = СтрШаблон("%1: %2", Контекст, Схема.Имя);
		Значение = ЗначениеСвойства(Параметры, Схема.Имя);
		
		Если Значение = Неопределено Тогда
			ДобавитьОшибку(Ошибки, Контекст, НСтр("ru = 'Отсутствует обязательный параметры URL'"));
		Иначе
			НовоеЗначение = ПривестиСтрокуКТипу(Схема.Тип, Значение);
			ПроверитьДанныеРекурсивно(Схема, НовоеЗначение, НовыйКонтекст, Ошибки);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Проверяет параметры запроса на соответствие схеме.
//
// Параметры:
//  Схемы - Массив из Структура
//  Параметры - Соответствие
//  Ошибки - Массив из Строка
//
Процедура ПроверитьПараметрыЗапроса(Схемы, Параметры, Ошибки)
	
	Контекст = НСтр("ru = 'Проверка параметров запроса'");
	
	Для Каждого Схема Из Схемы Цикл
		НовыйКонтекст = СтрШаблон("%1: %2", Контекст, Схема.Имя);
		Значение = ЗначениеСвойства(Параметры, Схема.Имя);
		
		Если Значение = Неопределено Тогда
			Если Схема.Обязательный Тогда
				ДобавитьОшибку(Ошибки, НовыйКонтекст, НСтр("ru = 'Отсутствует обязательный параметры запроса'"));
			КонецЕсли;
		Иначе
			НовоеЗначение = ПривестиСтрокуКТипу(Схема.Тип, Значение);
			ПроверитьДанныеРекурсивно(Схема, НовоеЗначение, НовыйКонтекст, Ошибки);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Проверяет тело запроса на соответствие схеме.
//
// Параметры:
//  Схемы - Массив из Структура
//  Тело - Произвольный
//  ТипКонтента - Строка
//  Ошибки - Массив из Строка
//
Процедура ПроверитьТелоЗапроса(Схемы, Тело, ТипКонтента, Ошибки)
	
	Контекст = НСтр("ru = 'Проверка тела запроса'");
	
	Если СхемыHTTPСервисовПовтИсп.ЭтоТипКонтентаНетКонтента(ТипКонтента) Тогда
		Если ЗначениеЗаполнено(Тело) Тогда
			ДобавитьОшибку(Ошибки, Контекст, НСтр("ru = 'Тело запроса должно быть пустым'"));
		КонецЕсли;
	Иначе
		СхемаНайдена = Ложь;
		
		Для Каждого Схема Из Схемы Цикл
			Если СхемыHTTPСервисовПовтИсп.ТипКонтента(Схема.Тип) = ТипКонтента Тогда
				СхемаНайдена = Истина;
				
				// TODO - Костыль
				Если НЕ Схема.Обязательный И НЕ ЗначениеЗаполнено(Тело) Тогда
					Прервать;
				Иначе
					НовыйКонтекст = СтрШаблон("%1: ", Контекст);
					ПроверитьДанныеРекурсивно(Схема.Контент, Тело, НовыйКонтекст, Ошибки);
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ СхемаНайдена Тогда
			ДобавитьОшибку(Ошибки, Контекст, НСтр("ru = 'Неподдерживаемый тип тела запроса'"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкаОтвета

// Проверяет заголовки ответа на соответствие схеме.
//
// Параметры:
//  Схемы - Массив из Структура
//  Заголовки - Соответствие
//  КодСостояния - Число
//  ТипКонтента - Строка
//  Ошибки - Массив из Строка
//
Процедура ПроверитьЗаголовкиОтвета(Схемы, Заголовки, КодСостояния, ТипКонтента, Ошибки)
	
	Контекст = НСтр("ru = 'Проверка заголовков ответа'");
	
	Для Каждого Схема Из Схемы Цикл
		Если СхемыHTTPСервисовПовтИсп.ТипКонтента(Схема.Тип) = ТипКонтента
				И Схема.КодСостояния = КодСостояния Тогда
			Для Каждого ВложеннаяСхема Из Схема.Заголовки Цикл
				НовыйКонтекст = СтрШаблон("%1: %2", Контекст, ВложеннаяСхема.Имя);
				Значение = ЗначениеСвойства(Заголовки, ВложеннаяСхема.Имя);
				
				Если Значение = Неопределено Тогда
					Если ВложеннаяСхема.Обязательный Тогда
						ДобавитьОшибку(Ошибки, НовыйКонтекст, НСтр("ru = 'Отсутствует обязательный заголовок'"));
					КонецЕсли;
				Иначе
					ПроверитьДанныеРекурсивно(ВложеннаяСхема, Значение, НовыйКонтекст, Ошибки);
				КонецЕсли;
			КонецЦикла;
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Проверяет тело ответа на соответствие схеме.
//
// Параметры:
//  Схемы - Масив из Структура
//  Тело - Произвольный
//  КодСостояния - Число
//  ТипКонтента - Строка
//  Ошибки - Массив из Строка
//
Процедура ПроверитьТелоОтвета(Схемы, Тело, КодСостояния, ТипКонтента, Ошибки)
	
	Контекст = НСтр("ru = 'Проверка тела ответа'");
	
	Если СхемыHTTPСервисовПовтИсп.ЭтоТипКонтентаНетКонтента(ТипКонтента) Тогда
		Если ЗначениеЗаполнено(Тело) Тогда
			ДобавитьОшибку(Ошибки, Контекст, НСтр("ru = 'Тело ответа должно быть пустым'"));
		КонецЕсли;
	Иначе
		СхемаНайдена = Ложь;
		
		Для Каждого Схема Из Схемы Цикл
			Если СхемыHTTPСервисовПовтИсп.ТипКонтента(Схема.Тип) = ТипКонтента И Схема.КодСостояния = КодСостояния Тогда
				СхемаНайдена = Истина;
				НовыйКонтекст = СтрШаблон("%1: ", Контекст);
				ПроверитьДанныеРекурсивно(Схема.Контент, Тело, НовыйКонтекст, Ошибки);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ СхемаНайдена Тогда
			ДобавитьОшибку(Ошибки, Контекст, НСтр("ru = 'Неподдерживаемый тип тела ответа'"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкаПоТипам

// Проверяет данные с типом Булево на соответствие схеме.
//
// Параметры:
//  Схема - Структура
//  Данные - Булево
//  Контекст - Строка
//  Ошибки - Массив из Строка
//
Процедура ПроверитьБулево(Схема, Данные, Контекст, Ошибки)
	
	Если Данные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДоступныеЗначения(Схема, Данные, Контекст, Ошибки);
	
КонецПроцедуры

// Проверяет данные с неизвестным типом на соответствие вариантам схемы.
//
// Параметры:
//  Схемы - Массив из Структура
//  Опциональные - Булево
//  Данные - Строка, Число, Булево, Массив, Структура, Соответствие, Неопределено
//  Контекст - Строка
//  Ошибки - Массив из Строка
//
Процедура ПроверитьВариантыДанныхРекурсивно(Схемы, Опциональные, Данные, Контекст, Ошибки)
	
	КоличествоСовпадений = 0;
	
	Для Каждого Схема Из Схемы Цикл
		НовыеОшибки = Новый Массив;
		ПроверитьДанныеРекурсивно(Схема, Данные, Контекст, НовыеОшибки);
		
		Если НовыеОшибки.Количество() = 0 Тогда
			КоличествоСовпадений = КоличествоСовпадений + 1;
			
			Если Опциональные Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если КоличествоСовпадений = 0 Тогда
		ДобавитьОшибку(Ошибки, Контекст, НСтр("ru = 'Данные не соответствуют ни одному из вариантов'"));
	ИначеЕсли КоличествоСовпадений > 1 И НЕ Опциональные Тогда
		ДобавитьОшибку(Ошибки, Контекст, НСтр("ru = 'Данные должны соответствовать только одному из вариантов'"));
	КонецЕсли; // BSLLS:IfElseIfEndsWithElse-off
	
КонецПроцедуры

// Проверяет данные с неизвестным типом на соответствие схеме.
//
// Параметры:
//  Схема - Структура
//  Данные - Строка, Число, Булево, Массив, Структура, Соответствие, Неопределено
//  Контекст - Строка
//  Ошибки - Массив из Строка
//
Процедура ПроверитьДанныеРекурсивно(Схема, Данные, Контекст, Ошибки)
	
	Если Схема = Неопределено И Данные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Варианты = ЗначениеСвойства(Схема, "Варианты");
	
	Если Варианты <> Неопределено Тогда
		Опциональные = ЗначениеСвойства(Схема, "Опциональные", Ложь);
		ПроверитьВариантыДанныхРекурсивно(Варианты, Опциональные, Данные, Контекст, Ошибки);
	Иначе
		Если НЕ ТипСоответствует(Схема, Данные) Тогда
			ДобавитьОшибку(Ошибки, Контекст, НСтр("ru = 'Неверный тип данных'"));
			Возврат;
		КонецЕсли;
		
		Если СхемыHTTPСервисовПовтИсп.ЭтоТипДанныхОбъект(Схема.Тип) Тогда
			ПроверитьОбъект(Схема, Данные, Контекст, Ошибки);
		ИначеЕсли СхемыHTTPСервисовПовтИсп.ЭтоТипДанныхМассив(Схема.Тип) Тогда
			ПроверитьМассив(Схема, Данные, Контекст, Ошибки);
		ИначеЕсли СхемыHTTPСервисовПовтИсп.ЭтоТипДанныхЧисло(Схема.Тип) Тогда
			ПроверитьЧисло(Схема, Данные, Контекст, Ошибки);
		ИначеЕсли СхемыHTTPСервисовПовтИсп.ЭтоТипДанныхСтрока(Схема.Тип) 
				И НЕ СхемыHTTPСервисовПовтИсп.ЭтоФорматДанныхДвоичныеДанные(Схема.Формат) Тогда
			ПроверитьСтроку(Схема, Данные, Контекст, Ошибки);
		ИначеЕсли СхемыHTTPСервисовПовтИсп.ЭтоТипДанныхБулево(Схема.Тип) Тогда
			ПроверитьБулево(Схема, Данные, Контекст, Ошибки);
		Иначе
			ДобавитьОшибку(Ошибки, Контекст, НСтр("ru = 'Неизвестный тип данных'"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Проверяет данные с типом Массив на соответствие схеме/
//
// Параметры:
//  Схема - Структура
//  Данные - Массив
//  Контекст - Строка
//  Ошибки - Массив из Строка
//
Процедура ПроверитьМассив(Схема, Данные, Контекст, Ошибки)
	
	Если Данные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МинимальноеКоличество(Схема, Данные, Контекст, Ошибки);
	МаксимальноеКоличество(Схема, Данные, Контекст, Ошибки);
	ДоступныеЗначения(Схема, Данные, Контекст, Ошибки);
	
	Для Индекс = 0 По Данные.ВГраница() Цикл
		НовыйКонтекст = СтрШаблон("%1[%2]", Контекст, XMLСтрока(Индекс));
		ПроверитьДанныеРекурсивно(Схема.Элементы[0], Данные[Индекс], НовыйКонтекст, Ошибки);
	КонецЦикла;
	
КонецПроцедуры

// Проверяет данные с типом Объект на соответствие схеме.
//
// Параметры:
//  Схема - Структура
//  Данные - Структура, Соответствие
//  Контекст - Строка
//  Ошибки - Массив из Строка
//
Процедура ПроверитьОбъект(Схема, Данные, Контекст, Ошибки)
	
	Если Данные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МинимальноеКоличество(Схема, Данные, Контекст, Ошибки);
	МаксимальноеКоличество(Схема, Данные, Контекст, Ошибки);
	
	Для Каждого Свойство Из Схема.Свойства Цикл
		НовыйКонтекст = СтрШаблон("%1.%2", Контекст, Свойство.Имя);
		
		Если ЕстьСвойство(Данные, Свойство.Имя) Тогда
			Значение = ЗначениеСвойства(Данные, Свойство.Имя);
			ПроверитьДанныеРекурсивно(Свойство, Значение, НовыйКонтекст, Ошибки);
		Иначе
			Если Свойство.Обязательный Тогда
				ДобавитьОшибку(Ошибки, НовыйКонтекст, НСтр("ru = 'Отсутствует обязательное свойство'"));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Схема.ДополнительныеСвойства = Ложь И Данные.Количество() > Схема.Свойства.Количество() Тогда
		ТекстОшибки = СтрШаблон("Не должен содержать дополнительных свойств");
		ДобавитьОшибку(Ошибки, Контекст, ТекстОшибки);
	ИначеЕсли Коллекции.ЭтоСтруктура(Схема.ДополнительныеСвойства) Тогда
		Для Каждого ЭлементДанных Из Данные Цикл
			НовыйКонтекст = СтрШаблон("%1.%2", Контекст, ЭлементДанных.Ключ);
			
			Если НЕ ЕстьСвойство(Схема.Свойства, ЭлементДанных.Ключ) Тогда
				ПроверитьДанныеРекурсивно(Схема.ДополнительныеСвойства, ЭлементДанных.Значение, НовыйКонтекст, Ошибки);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли; // BSLLS:IfElseIfEndsWithElse-off
	
КонецПроцедуры

// Проверяет данные с типом Строка на соответствие схеме.
//
// Параметры:
//  Схема - Структура
//  Данные - Строка
//  Контекст - Строка
//  Ошибки - Массив из Строка
//
Процедура ПроверитьСтроку(Схема, Данные, Контекст, Ошибки)
	
	Если Данные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МинимальнаяДлинна(Схема, Данные, Контекст, Ошибки);
	МаксимальнаяДлинна(Схема, Данные, Контекст, Ошибки);
	ДоступныеЗначения(Схема, Данные, Контекст, Ошибки);
	Паттерн(Схема, Данные, Контекст, Ошибки);
	_Формат(Схема, Данные, Контекст, Ошибки);
	
КонецПроцедуры

// Проверяет данные с типом Число на соответствие схеме.
//
// Параметры:
//  Схема - Структура
//  Данные - Число
//  Контекст - Строка
//  Ошибки - Массив из Строка
//
Процедура ПроверитьЧисло(Схема, Данные, Контекст, Ошибки)
	
	Если Данные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МинимальноеЗначение(Схема, Данные, Контекст, Ошибки);
	МаксимальноеЗначение(Схема, Данные, Контекст, Ошибки);
	ЗначениеКратно(Схема, Данные, Контекст, Ошибки);
	ДоступныеЗначения(Схема, Данные, Контекст, Ошибки);
	_Формат(Схема, Данные, Контекст, Ошибки);
	
КонецПроцедуры

// Проверяет данные на соответствие типов.
//
// Параметры:
//  Схема - Структура
//  Данные - Строка, Число, Булево, Массив, Структура, Соответствие, ДвоичныеДанные, Неопределено
//
// Возвращаемое значение:
//  Булево
//
Функция ТипСоответствует(Схема, Данные)
	
	Если Схема = Неопределено И Данные <> Неопределено Тогда
		ТипСоответствует = Ложь;
	ИначеЕсли СхемыHTTPСервисовПовтИсп.ЭтоТипДанныхОбъект(Схема.Тип) Тогда
		ТипСоответствует = Коллекции.ЭтоКоллекцияКлючЗначение(Данные);
	ИначеЕсли СхемыHTTPСервисовПовтИсп.ЭтоТипДанныхМассив(Схема.Тип) Тогда
		ТипСоответствует = Коллекции.ЭтоМассив(Данные);
	ИначеЕсли СхемыHTTPСервисовПовтИсп.ЭтоТипДанныхСтрока(Схема.Тип) 
			И СхемыHTTPСервисовПовтИсп.ЭтоФорматДанныхДвоичныеДанные(Схема.Формат) Тогда
		ТипСоответствует = ТипЗнч(Данные) = Тип("ДвоичныеДанные");
	Иначе
		Попытка
			ТипСоответствует = ТипЗнч(Данные) = Тип(Схема.Тип);
		Исключение
			ТипСоответствует = Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Если Схема.ДоступноNULL Тогда
		Результат = ТипСоответствует ИЛИ Данные = Неопределено;
	Иначе
		Результат = ТипСоответствует;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПроверкаПоСвойствам

// Проверяет данные с типом Строка, Число, Булево, Массив на соответствие доступным значениям.
//
// Параметры:
//  Схема - Структура
//  Данные - Число
//  Контекст - Строка
//  Ошибки - Массив из Строка
//
Процедура ДоступныеЗначения(Схема, Данные, Контекст, Ошибки)
	
	Если Схема.ДоступныеЗначения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СхемыHTTPСервисовПовтИсп.ЭтоТипДанныхМассив(Схема.Тип) Тогда
		Для Индекс = 0 По Данные.ВГраница() Цикл
			НовыйКонтекст = СтрШаблон("%1[%2]", Контекст, XMLСтрока(Индекс));
			ДоступныеЗначения(Данные[Индекс], Схема, НовыйКонтекст, Ошибки);
		КонецЦикла;
	ИначеЕсли Схема.ДоступныеЗначения.Найти(Данные) = Неопределено Тогда
		ДобавитьОшибку(Ошибки, Контекст, НСтр("ru = 'Недоступное значение'"));
	КонецЕсли; // BSLLS:IfElseIfEndsWithElse-off
	
КонецПроцедуры

// Проверяет данные с типом Число на соответствие кратности значению.
//
// Параметры:
//  Схема - Структура
//  Данные - Число
//  Контекст - Строка
//  Ошибки - Массив из Строка
//
Процедура ЗначениеКратно(Схема, Данные, Контекст, Ошибки)
	
	Если Схема.ЗначениеКратно = Неопределено ИЛИ Схема.ЗначениеКратно = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если (Данные % Схема.ЗначениеКратно) <> 0 Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Значение должно быть кратно %1'"),
			XMLСтрока(Схема.ЗначениеКратно));
		ДобавитьОшибку(Ошибки, Контекст, ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

// Проверяет данные с типом Строка на соответствие максимальной длине.
//
// Параметры:
//  Схема - Структура
//  Данные - Строка
//  Контекст - Строка
//  Ошибки - Массив из Строка
//
Процедура МаксимальнаяДлинна(Схема, Данные, Контекст, Ошибки)
	
	Если Схема.МаксимальнаяДлинна = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрДлина(Данные) > Схема.МаксимальнаяДлинна Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Длинна должна быть меньше или равна %1'"),
			XMLСтрока(Схема.МаксимальнаяДлинна));
		ДобавитьОшибку(Ошибки, Контекст, ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

// Проверяет данные с типом Число на соответствие максимальному значению.
//
// Параметры:
//  Схема - Структура
//  Данные - Число
//  Контекст - Строка
//  Ошибки - Массив из Строка
//
Процедура МаксимальноеЗначение(Схема, Данные, Контекст, Ошибки)
	
	Если Схема.МаксимальноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема.ИсключитьМаксимальноеЗначение И Данные >= Схема.МаксимальноеЗначение Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Значение должно быть меньше %1'"),
			XMLСтрока(Схема.МаксимальноеЗначение));
		ДобавитьОшибку(Ошибки, Контекст, ТекстОшибки);
	ИначеЕсли Данные > Схема.МаксимальноеЗначение Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Значение должно быть меньше или равно %1'"),
			XMLСтрока(Схема.МаксимальноеЗначение));
		ДобавитьОшибку(Ошибки, Контекст, ТекстОшибки);
	КонецЕсли; // BSLLS:IfElseIfEndsWithElse-off
	
КонецПроцедуры

// Проверяет данные с типом Массив и Объект на соответствие максимальному количеству элементов/свойств.
//
// Параметры:
//  Схема - Структура
//  Данные - Массив, Структура, Соответствие
//  Контекст - Строка
//  Ошибки - Массив из Строка
//
Процедура МаксимальноеКоличество(Схема, Данные, Контекст, Ошибки)
	
	Если Схема.МаксимальноеКоличество = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Данные.Количество() > Схема.МаксимальноеКоличество Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Количество элементов должно быть меньше или равно %1'"),
			XMLСтрока(Схема.МаксимальноеКоличество));
		ДобавитьОшибку(Ошибки, Контекст, ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

// Проверяет данные с типом Строка на соответствие минимальной длине.
//
// Параметры:
//  Схема - Структура
//  Данные - Строка
//  Контекст - Строка
//  Ошибки - Массив из Строка
//
Процедура МинимальнаяДлинна(Схема, Данные, Контекст, Ошибки)
	
	Если Схема.МинимальнаяДлинна = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрДлина(Данные) < Схема.МинимальнаяДлинна Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Длинна должна быть больше или равна %1'"),
			XMLСтрока(Схема.МинимальнаяДлинна));
		ДобавитьОшибку(Ошибки, Контекст, ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

// Проверяет данные с типом Число на соответствие минимальному значению.
//
// Параметры:
//  Схема - Структура
//  Данные - Число
//  Контекст - Строка
//  Ошибки - Массив из Строка
//
Процедура МинимальноеЗначение(Схема, Данные, Контекст, Ошибки)
	
	Если Схема.МинимальноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема.ИсключитьМинимальноеЗначение И Данные <= Схема.МинимальноеЗначение Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Значение должно быть больше %1'"),
			XMLСтрока(Схема.МинимальноеЗначение));
		ДобавитьОшибку(Ошибки, Контекст, ТекстОшибки);
	ИначеЕсли Данные < Схема.МинимальноеЗначение Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Значение должно быть больше или равно %1'"),
			XMLСтрока(Схема.МинимальноеЗначение));
		ДобавитьОшибку(Ошибки, Контекст, ТекстОшибки);
	КонецЕсли; // BSLLS:IfElseIfEndsWithElse-off
	
КонецПроцедуры

// Проверяет данные с типом Массив и Объект на соответствие минимальному количеству элементов/свойств.
//
// Параметры:
//  Схема - Структура
//  Данные - Массив, Структура, Соответствие
//  Контекст - Строка
//  Ошибки - Массив из Строка
//
Процедура МинимальноеКоличество(Схема, Данные, Контекст, Ошибки)
	
	Если Схема.МинимальноеКоличество = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Данные.Количество() < Схема.МинимальноеКоличество Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Количество элементов должно быть больше или равно %1'"),
			XMLСтрока(Схема.МинимальноеКоличество));
		ДобавитьОшибку(Ошибки, Контекст, ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

// Проверяет данные с типом Строка на соответствие паттерну.
//
// Параметры:
//  Схема - Структура
//  Данные - Строка
//  Контекст - Строка
//  Ошибки - Массив из Строка
//
Процедура Паттерн(Схема, Данные, Контекст, Ошибки)
	
	Если Схема.Паттерн = Неопределено ИЛИ Схема.Паттерн = "" ИЛИ НЕ ЗначениеЗаполнено(Данные) Тогда
		Возврат;
	КонецЕсли;
	
	Результат = СоответствуетПаттерну(Данные, Схема.Паттерн, Ложь);
	
	Если НЕ Результат Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Элемент должен соответствовать паттерну %1'"), Схема.Паттерн);
		ДобавитьОшибку(Ошибки, Контекст, ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

// Проверяет данные с типом Строка и Число на соответствие формату.
//
// Параметры:
//  Схема - Структура
//  Данные - Строка
//  Контекст - Строка
//  Ошибки - Массив из Строка
//
Процедура _Формат(Схема, Данные, Контекст, Ошибки)
	
	Если Схема.Формат = Неопределено ИЛИ Схема.Формат = "" ИЛИ НЕ ЗначениеЗаполнено(Данные) Тогда
		Возврат;
	КонецЕсли;
	
	Если СхемыHTTPСервисовПовтИсп.ЭтоФорматданныхУникальныйИдентификатор(Схема.Формат) Тогда
		Паттерн = "^[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}$";
		Результат = СоответствуетПаттерну(Данные, Паттерн);
	ИначеЕсли СхемыHTTPСервисовПовтИсп.ЭтоФорматДанныхАдресЭлектроннойПочты(Схема.Формат) Тогда
		Паттерн = "^[a-z0-9!#$%&'*+/=?^_`{|}~-]+(?:\.[a-z0-9!#$%&'*+/=?^_`{|}~-]+)*"
			+ "@(?:[a-z0-9\u0400-\u04FF](?:[a-z0-9\u0400-\u04FF-]{0,61}[a-z0-9\u0400-\u04FF])?\.)+"
			+ "[a-z\u0400-\u04FF]{2,}$";
		Результат = СоответствуетПаттерну(Данные, Паттерн);
	ИначеЕсли СхемыHTTPСервисовПовтИсп.ЭтоФорматДанныхДата(Схема.Формат) Тогда
		Паттерн = "^\d{4}-(0[1-9]|1[0-2])-(0[1-9]|[12]\d|3[01])$";
		Результат = СоответствуетПаттерну(Данные, Паттерн);
	ИначеЕсли СхемыHTTPСервисовПовтИсп.ЭтоФорматДанныхДатаВремя(Схема.Формат) Тогда
		Паттерн = "^\d{4}-(0[1-9]|1[0-2])-(0[1-9]|[12]\d|3[01])"
			+ "T([01]\d|2[0-3]):[0-5]\d:[0-5]\d(\.\d+)?(Z|[+-]([01]\d|2[0-3]):[0-5]\d)$";
		Результат = СоответствуетПаттерну(Данные, Паттерн);
	ИначеЕсли СхемыHTTPСервисовПовтИсп.ЭтоФорматДанныхЦелоеЧисло(Схема.Формат) Тогда
		Результат = Цел(Данные) = Данные
			И Данные > -2147483648 И Данные <= 2147483647;
	ИначеЕсли СхемыHTTPСервисовПовтИсп.ЭтоФорматДанныхБольшоеЦелоеЧисло(Схема.Формат) Тогда
		Результат = Цел(Данные) = Данные
			И Данные > -9223372036854775808 И Данные <= 9223372036854775807;
	Иначе
		Результат = Истина;
	КонецЕсли;
	
	Если НЕ Результат Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Элемент должен соответствовать формату %1'"), Схема.Формат);
		ДобавитьОшибку(Ошибки, Контекст, ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Конструкторы

// Конструктор нового описания запроса.
//
// Возвращаемое значение:
//  Структура:
//    * Агент - Строка
//    * БазовыйURL - Строка
//    * ВнешнийИдентификатор - Строка
//    * Заголовки - Соответствие
//    * КорневойURL - Строка
//    * Метод - Строка
//    * ОтносительныйURL - Строка
//    * ПараметрыURL - Соответствие
//    * ПараметрыЗапроса - Соответствие
//    * СхемаURL - Строка
//    * ТелоКакДвоичныеДанные - ДвоичныеДанные, Неопределено
//    * ТелоКакОбъект - Массив, Структура, Соответствие, Неопределено
//    * ТелоКакСтрока - Строка - Строка
//    * ТипКонтента - Строка
//
Функция НовыйЗапрос()
	
	Запрос = Новый Структура;
	Запрос.Вставить("Агент", "");
	Запрос.Вставить("БазовыйURL", "");
	Запрос.Вставить("ВнешнийИдентификатор", "");
	Запрос.Вставить("Заголовки", Новый Соответствие);
	Запрос.Вставить("КорневойURL", "");
	Запрос.Вставить("Метод", "");
	Запрос.Вставить("ОтносительныйURL", "");
	Запрос.Вставить("ПараметрыURL", Новый Соответствие);
	Запрос.Вставить("ПараметрыЗапроса", Новый Соответствие);
	Запрос.Вставить("СхемаURL", "");
	Запрос.Вставить("ТелоКакДвоичныеДанные");
	Запрос.Вставить("ТелоКакОбъект");
	Запрос.Вставить("ТелоКакСтрока", "");
	Запрос.Вставить("ТипКонтента", "");
	Возврат Запрос;
	
КонецФункции

// Конструктор нового контекста.
//
// Возвращаемое значение:
//  Структура:
//    * HTTPСервис - СправочникСсылка.HTTPСервисы
//    * HTTPСервисЗапрос - HTTPСервисЗапрос
//    * HTTPСервисОтвет - HTTPСервисОтвет
//    * Включен - Булево
//    * Запрос - см. НовыйЗапрос
//    * ИдентификаторЗапроса - Строка
//    * ОбработчикЗапроса - ОбработкаОбъект.ОбработчикHTTPСервисЗапроса
//    * ОбработчикОтвета - ОбработкаОбъект.ОбработчикHTTPСервисОтвета
//    * Ответ - см. НовыйОтвет
//    * ОшибкиКлиента - Массив из Строка
//    * ОшибкиПравДоступа - Массив из Строка
//    * ОшибкиСервера - Массив из Строка
//    * Результат - см. НовыйРезультат
//    * Схема - Структура
//
Функция НовыйКонтекст()
	
	Контекст = Новый Структура;
	Контекст.Вставить("HTTPСервис", Справочники.HTTPСервисы.ПустаяСсылка());
	Контекст.Вставить("HTTPСервисЗапрос");
	Контекст.Вставить("HTTPСервисОтвет");
	Контекст.Вставить("Включен", Ложь);
	Контекст.Вставить("Запрос", НовыйЗапрос());
	Контекст.Вставить("ИдентификаторЗапроса", "");
	Контекст.Вставить("ОбработчикЗапроса");
	Контекст.Вставить("ОбработчикОтвета");
	Контекст.Вставить("Ответ", НовыйОтвет());
	Контекст.Вставить("ОшибкиКлиента", Новый Массив);
	Контекст.Вставить("ОшибкиПравДоступа", Новый Массив);
	Контекст.Вставить("ОшибкиСервера", Новый Массив);
	Контекст.Вставить("Результат", НовыйРезультат());
	Контекст.Вставить("Схема");
	Возврат Контекст;
	
КонецФункции

// Конструктор новой таблицы обработчиков.
//
// Возвращаемое значение:
//  ТаблицаЗначения:
//    * HTTPСервис - СправочникСсылка.HTTPСервисы
//    * ВПривилегированномРежиме - Булево
//    * ВТранзакции - Булево
//    * Обработчик - Строка
//
Функция НовыйОбработчики()
	
	Обработчики = Новый ТаблицаЗначений;
	Обработчики.Колонки.Добавить("HTTPСервис", Новый ОписаниеТипов("СправочникСсылка.HTTPСервисы"));
	Обработчики.Колонки.Добавить("ВПривилегированномРежиме", Новый ОписаниеТипов("Булево"));
	Обработчики.Колонки.Добавить("ВТранзакции", Новый ОписаниеТипов("Булево"));
	Обработчики.Колонки.Добавить("Обработчик", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100)));
	Возврат Обработчики;
	
КонецФункции

// Конструктор нового описания ответа.
//
// Возвращаемое значение:
//  Структура:
//    * ВнешнийИдентификатор - Строка
//    * Заголовки - Соответствие
//    * КодСостояния - Строка
//    * Причина - Строка
//    * ТелоКакДвоичныеДанные - ДвоичныеДанные, Неопределено
//    * ТелоКакОбъект - Структура, Соответствие, Массив
//    * ТелоКакСтрока - Строка
//    * ТипКонтента - Строка
//
Функция НовыйОтвет()
	
	Ответ = Новый Структура;
	Ответ.Вставить("ВнешнийИдентификатор", "");
	Ответ.Вставить("Заголовки", Новый Соответствие);
	Ответ.Вставить("КодСостояния", 200);
	Ответ.Вставить("Причина", "");
	Ответ.Вставить("ТелоКакДвоичныеДанные");
	Ответ.Вставить("ТелоКакОбъект");
	Ответ.Вставить("ТелоКакСтрока", "");
	Ответ.Вставить("ТипКонтента", "");
	Возврат Ответ;
	
КонецФункции

// Конструктор нового результата.
//
// Возвращаемое значение:
//  Структура:
//    * Заголовки - Соответствие
//    * КодСостояния - Число
//    * Причина - Строка
//    * Тело - Строка
//
Функция НовыйРезультат()
	
	Результат = Новый Структура;
	Результат.Вставить("Заголовки", Новый Соответствие);
	Результат.Вставить("КодСостояния", 200);
	Результат.Вставить("Причина", "");
	Результат.Вставить("Тело", "");
	Возврат Результат;
	
КонецФункции

#КонецОбласти

// Добавляет ошибку в коллекцию ошибок.
//
// Параметры:
//  Ошибки - Массив из Строка
//  Контекст - Строка
//  Текст - Строка
//
Процедура ДобавитьОшибку(Ошибки, Контекст, Текст)
	
	Ошибки.Добавить(СтрШаблон("%1 | %2", Контекст, Текст));
	
КонецПроцедуры

// Проверяет наличие свойства по ключу.
//
// Параметры:
//  Коллекция - Структура, Соответствие
//  Свойство - Строка
//
// Возвращаемое значение:
//  Булево
//
Функция ЕстьСвойство(Коллекция, Свойство)
	
	Возврат Коллекции.ЕстьСвойствоКоллекцииКлючЗначение(Коллекция, Свойство);
	
КонецФункции

// Возвращает значение свойства по ключу.
// Если ключ не найден, возвращает значение по умолчанию.
//
// Параметры:
//  Коллекция - Структура, Соответствие
//  Свойство - Строка
//  ЗначениеПоУмолчанию - Произвольный
//
// Возвращаемое значение:
//  Произвольный
//
Функция ЗначениеСвойства(Коллекция, Свойство, ЗначениеПоУмолчанию = Неопределено)
	
	Возврат Коллекции.ЗначениеСвойстваКоллекцииКлючЗначение(
		Коллекция, Свойство, ЗначениеПоУмолчанию);
	
КонецФункции

// Преобразовывает строку к типу.
//
// Параметры:
//  Тип - Строка
//  Значение - Строка
//
// Возвращаемое значение:
//  Произвольный
//
Функция ПривестиСтрокуКТипу(Тип, Значение)
	
	Если СхемыHTTPСервисовПовтИсп.ЭтоТипДанныхЧисло(Тип) Тогда
		НовоеЗначение = СтрокаВЧисло(Значение);
	ИначеЕсли СхемыHTTPСервисовПовтИсп.ЭтоТипДанныхБулево(Тип) Тогда
		НовоеЗначение = СтрокаВБулево(Значение);
	Иначе
		НовоеЗначение = Значение;
	КонецЕсли;
	
	Возврат НовоеЗначение;
	
КонецФункции

// Проверяет строку на соответствие паттерну.
//
// Параметры:
//  Значение - Строка
//  Паттерн - Строка
//  ИгнорироватьРегистр - Булево
//
// Возвращаемое значение:
//  Булево
//
Функция СоответствуетПаттерну(Значение, Паттерн, ИгнорироватьРегистр = Истина)
	
	Попытка
		СоответствуетПаттерну = СтрПодобнаПоРегулярномуВыражению(Значение, Паттерн, ИгнорироватьРегистр, Ложь);
	Исключение
		СоответствуетПаттерну = Ложь;
	КонецПопытки;
	
	Возврат СоответствуетПаттерну;
	
КонецФункции

// Преобразовывает строку в булево.
//
// Параметры:
//  Значение - Строка
//
// Возвращаемое значение:
//  Булево
//
Функция СтрокаВБулево(Значение)
	
	СоответствиеЗначений = Новый Соответствие;
	СоответствиеЗначений.Вставить("true", Истина);
	СоответствиеЗначений.Вставить("false", Ложь);
	СоответствиеЗначений.Вставить("истина", Истина);
	СоответствиеЗначений.Вставить("ложь", Ложь);
	НовоеЗначение = СоответствиеЗначений.Получить(НРег(Значение));
	Возврат ?(НовоеЗначение = Неопределено, Значение, НовоеЗначение);
	
КонецФункции

// Преобразовывает строку в число.
//
// Параметры:
//  Значение - Строка
//
// Возвращаемое значение:
//  Число
//
Функция СтрокаВЧисло(Значение)
	
	Значение  = СтрЗаменить(Значение, " ", "");
	
	Если СтрНачинаетсяС(Значение, "(") Тогда
		Значение = СтрЗаменить(Значение, "(", "-");
		Значение = СтрЗаменить(Значение, ")", "");
	КонецЕсли;
	
	СтрокаБезНулей = СтрЗаменить(Значение, "0", "");
	
	Если ПустаяСтрока(СтрокаБезНулей) Или СтрокаБезНулей = "-" Тогда
		Возврат 0;
	КонецЕсли;
	
	ТипЧисло  = Новый ОписаниеТипов("Число");
	Результат = ТипЧисло.ПривестиЗначение(Значение);
	НовоеЗначение = ?(Результат <> 0 И Не ПустаяСтрока(СтрокаБезНулей), Результат, Неопределено);
	Возврат ?(НовоеЗначение = Неопределено, Значение, НовоеЗначение);
	
КонецФункции

// Возвращает тело по типу контента.
//
// Параметры:
//  Источник - Структура
//
// Возвращаемое значение:
//  - Структура, Соответствие, Массив
//  - Строка
//  - ДвоичныеДанные
//  - Неопределено
//
Функция ТелоПоТипуКонтента(Источник)
	
	Если СхемыHTTPСервисовПовтИсп.ЭтоТипКонтентаJSON(Источник.ТипКонтента) Тогда
		Результат = Источник.ТелоКакОбъект;
	ИначеЕсли СхемыHTTPСервисовПовтИсп.ЭтоТипКонтентаСтрока(Источник.ТипКонтента) Тогда
		Результат = Источник.ТелоКакСтрока;
	ИначеЕсли СхемыHTTPСервисовПовтИсп.ЭтоТипКонтентаДвоичныеДанные(Источник.ТипКонтента) Тогда
		Результат = Источник.ТелоКакДвоичныеДанные;
	ИначеЕсли СхемыHTTPСервисовПовтИсп.ЭтоТипКонтентаНетКонтента(Источник.ТипКонтента) Тогда
		Результат = "";
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
